[
    {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/ypQ87fF/book1.png",
      "review": "The Great Gatsby is a timeless classic written by F. Scott Fitzgerald. Set in the roaring 1920s, it follows the enigmatic Jay Gatsby, a wealthy and mysterious man, through the eyes of Nick Carraway, a young and impressionable narrator. Fitzgerald's prose captures the essence of the Jazz Age, with its glitz, glamour, and excess, while also delving into deeper themes of love, longing, and the American Dream. The characters are vividly drawn, each representing a different facet of society, and the story is filled with intrigue, betrayal, and tragedy. With its lush descriptions and haunting narrative, The Great Gatsby remains one of the most beloved and enduring works of American literature.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 2,
      "bookName": "1984 Book",
      "author": "George Orwell",
      "image": "https://i.ibb.co/b6pPn3z/book2.png",
      "review": "To Kill a Mockingbird, written by Harper Lee, is a powerful and poignant novel that explores themes of racism, injustice, and morality in the American South during the 1930s. Through the eyes of young Scout Finch, the reader witnesses the trial of Tom Robinson, a black man falsely accused of raping a white woman, and the moral courage of her father, Atticus Finch, who defends him. Lee's masterful storytelling and vivid characters bring the small town of Maycomb, Alabama, to life, drawing readers into a world of prejudice, compassion, and humanity. With its timeless message of empathy and understanding, To Kill a Mockingbird continues to resonate with readers of all ages.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/Jk4RdxJ/book3.png",
      "review": "1984, written by George Orwell, is a dystopian novel that explores the dangers of totalitarianism and the erosion of individual freedom. Set in a bleak and oppressive society ruled by the Party and its leader, Big Brother, the story follows Winston Smith, a low-ranking member of the Party who begins to question the oppressive regime. Orwell's chilling vision of a surveillance state, thought control, and propaganda remains disturbingly relevant in today's world, serving as a cautionary tale against the dangers of unchecked power and the manipulation of truth. With its thought-provoking themes and powerful message, 1984 continues to captivate readers and provoke discussion.",
      "totalPages": 336,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classic", "Coming-of-age"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/HdCSrPG/book4.png",
      "review": "The Catcher in the Rye, written by J.D. Salinger, is a coming-of-age novel that follows the disillusioned teenager Holden Caulfield as he navigates the challenges of adolescence and the adult world. Through Holden's cynical and introspective narration, the reader is taken on a journey of self-discovery, alienation, and rebellion against societal norms. Salinger's portrayal of teenage angst and isolation resonates with readers of all generations, capturing the universal experience of growing up and searching for meaning in a world that often seems confusing and hypocritical. With its honest depiction of youth and identity, The Catcher in the Rye remains a classic and enduring work of literature.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming-of-age", "Literary"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 5,
      "bookName": "The Hitchhiker's the Galaxy",
      "author": "Douglas Adams",
      "image": "https://i.ibb.co/fCxvnP6/book5.png",
      "review": "Pride and Prejudice, written by Jane Austen, is a classic novel that explores themes of love, marriage, and social class in 19th-century England. Through the lively and intelligent protagonist, Elizabeth Bennet, Austen offers a witty and incisive commentary on the societal expectations and gender roles of the time.",
      "totalPages": 200,
      "rating": 4.6,
      "category": "Science Fiction",
      "tags": ["Humor", "Adventure"],
      "publisher": "Pan Books",
      "yearOfPublishing": 1979
    },
    {
      "bookId": 6,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/RSFq6HK/book6.png",
      "review": "The Hobbit, written by J.R.R. Tolkien, is a beloved fantasy novel that follows the adventures of Bilbo Baggins, a hobbit who embarks on a quest to reclaim a treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and a host of other magical creatures, as well as the enigmatic Gollum and the wise wizard Gandalf. Tolkien's richly imagined world of Middle-earth is brought to life through his vivid descriptions and intricate mythology, captivating readers with its depth and complexity. With its themes of courage, friendship, and the triumph of good over evil, The Hobbit remains a timeless classic that continues to enchant readers of all ages.",
      "totalPages": 432,
      "rating": 4.9,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    }
  ]
  